In [1]:
import pandas as pd
import numpy as np

In [2]:
sales = pd.read_csv('sales.csv')

In [3]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2935849 entries, 0 to 2935848
Data columns (total 5 columns):
 #   Column        Dtype
---  ------        -----
 0   date          object
 1   shop_id       int64
 2   item_id       int64
 3   item_price    float64
 4   item_cnt_day  float64
dtypes: float64(2), int64(2), object(1)
memory usage: 112.0+ MB

#date :판매날자 / shop_id : 판매장소 / item_id : 물품명
 item_price : 물품가격/ item_cnt_day : 일당 팔린 개수

In [4]:
sales.head(1)

         date  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013       59    22154       999.0           1.0

In [5]:
sales['date'].unique()

array(['02.01.2013', '03.01.2013', '05.01.2013', ..., '28.10.2015',
       '25.10.2015', '13.10.2015'], dtype=object)

In [6]:
sales.sort_values('date')

               date  shop_id  item_id  item_price  item_cnt_day
16164    01.01.2013       28    11613      1499.0           1.0
101474   01.01.2013       51    10283       667.0           1.0
10197    01.01.2013       19     2828       499.0           1.0
101457   01.01.2013       51    10390       150.0           1.0
101455   01.01.2013       51    10591       110.0           1.0
...             ...      ...      ...         ...           ...
2263531  31.12.2014       10    15784       195.0           1.0
2238358  31.12.2014       31    18624       499.0           1.0
2238360  31.12.2014       31    18622       169.0           1.0
2210313  31.12.2014       59     9412       299.0           1.0
2239634  31.12.2014       34    15336       529.0           1.0

[2935849 rows x 5 columns]

In [7]:
sales.value_counts(['shop_id'])

shop_id
31         235636
25         186104
54         143480
28         142234
57         117428
42         109253
27         105366
6           82663
58          71441
56          69573
46          66321
50          65173
19          63911
15          59511
35          58445
21          58133
7           58076
47          56695
26          53910
18          53227
24          53032
53          52921
16          52734
30          50860
29          49225
38          46013
22          45434
51          44433
52          43502
59          42108
41          41967
37          39638
44          39530
43          39282
4           38242
5           38179
14          36979
45          35891
55          34769
12          34694
2           25991
3           25532
17          22950
48          21612
10          21397
13          17824
49          15849
39          13440
0            9857
32           7947
23           6963
34           5752
1            5678
33           5027
40           4257
9            3751
8            3412
20           1792
11            499
36            306
dtype: int64

In [8]:
len(sales['shop_id'].unique()) #판매장소의 수

60

In [1]:
sales.value_counts(['item_id'])

NameError: name 'sales' is not defined

In [10]:
len(sales['item_id'].unique())

21807

In [11]:
sales.isnull().sum()

date            0
shop_id         0
item_id         0
item_price      0
item_cnt_day    0
dtype: int64

In [12]:
sales.value_counts(['item_price'])

item_price
299.000000       291352
399.000000       242603
149.000000       218432
199.000000       184044
349.000000       101461
                  ...
709.700000            1
709.920000            1
710.333333            1
710.450000            1
307980.000000         1
Length: 19993, dtype: int64

In [13]:
len(sales['item_price'].unique())

19993

In [14]:
sales['item_price'].describe() # 이상치 발견!!

count    2.935849e+06
mean     8.908532e+02
std      1.729800e+03
min     -1.000000e+00
25%      2.490000e+02
50%      3.990000e+02
75%      9.990000e+02
max      3.079800e+05
Name: item_price, dtype: float64

In [15]:
sales[sales['item_price'] <= 0]

              date  shop_id  item_id  item_price  item_cnt_day
484683  15.05.2013       32     2973        -1.0           1.0

In [16]:
sales[sales['item_price'] ==sales['item_price'].max()] #가장 비싼값의 물건을 보기

               date  shop_id  item_id  item_price  item_cnt_day
1163158  13.12.2013       12     6066    307980.0           1.0

In [17]:
sales[sales['item_id'] ==6066]

               date  shop_id  item_id  item_price  item_cnt_day
1163158  13.12.2013       12     6066    307980.0           1.0

In [18]:
sales[sales['item_id'] ==2973]

               date  shop_id  item_id  item_price  item_cnt_day
352      15.01.2013       25     2973     2499.00          13.0
353      16.01.2013       25     2973     2499.00           5.0
354      17.01.2013       25     2973     2499.00           3.0
355      18.01.2013       25     2973     2499.00           2.0
356      19.01.2013       25     2973     2499.00           3.0
...             ...      ...      ...         ...           ...
1765321  22.06.2014       57     2973     1249.50           1.0
1782298  09.06.2014       47     2973     1249.00           1.0
1851765  04.07.2014       26     2973     1249.50           1.0
1923837  06.08.2014        6     2973     1249.50           1.0
2131937  20.11.2014       51     2973     1832.37           1.0

[780 rows x 5 columns]

In [19]:
sales['shop_id'].value_counts()

31    235636
25    186104
54    143480
28    142234
57    117428
42    109253
27    105366
6      82663
58     71441
56     69573
46     66321
50     65173
19     63911
15     59511
35     58445
21     58133
7      58076
47     56695
26     53910
18     53227
24     53032
53     52921
16     52734
30     50860
29     49225
38     46013
22     45434
51     44433
52     43502
59     42108
41     41967
37     39638
44     39530
43     39282
4      38242
5      38179
14     36979
45     35891
55     34769
12     34694
2      25991
3      25532
17     22950
48     21612
10     21397
13     17824
49     15849
39     13440
0       9857
32      7947
23      6963
34      5752
1       5678
33      5027
40      4257
9       3751
8       3412
20      1792
11       499
36       306
Name: shop_id, dtype: int64

In [20]:
sales.value_counts(['item_cnt_day'])

item_cnt_day
1.0             2629372
2.0              194201
3.0               47350
4.0               19685
5.0               10474
                 ...
167.0                 1
179.0                 1
187.0                 1
194.0                 1
2169.0                1
Length: 198, dtype: int64

In [21]:
sales[sales['item_cnt_day'] ==sales['item_cnt_day'].max()]

               date  shop_id  item_id  item_price  item_cnt_day
2909818  28.10.2015       12    11373    0.908714        2169.0

In [22]:
sales[sales['item_cnt_day'] ==sales['item_cnt_day'].min()]

               date  shop_id  item_id  item_price  item_cnt_day
1057907  02.11.2013       12     8023        15.0         -22.0

In [23]:
sales[sales['item_cnt_day'] <=0 ] # -값들은 이상치로 본다!

               date  shop_id  item_id  item_price  item_cnt_day
2        05.01.2013       25     2552       899.0          -1.0
148      23.01.2013       25     2321       999.0          -1.0
175      07.01.2013       25     2199      1449.0          -1.0
807      02.01.2013       25     2330       599.0          -1.0
1041     13.01.2013       25     5034      1989.0          -1.0
...             ...      ...      ...         ...           ...
2934243  26.10.2015       25     3917       449.0          -1.0
2934462  18.10.2015       25     4896      6398.0          -1.0
2935263  05.10.2015       25    10039       249.0          -1.0
2935643  16.10.2015       25     7893      2990.0          -1.0
2935779  07.10.2015       25     7087       999.0          -1.0

[7356 rows x 5 columns]

In [24]:
len(sales['item_cnt_day'].unique())

198

In [25]:
sales['item_cnt_day'].describe()

count    2.935849e+06
mean     1.242641e+00
std      2.618834e+00
min     -2.200000e+01
25%      1.000000e+00
50%      1.000000e+00
75%      1.000000e+00
max      2.169000e+03
Name: item_cnt_day, dtype: float64

In [26]:
sales.value_counts(['date'])

date
28.12.2013    9434
29.12.2013    9335
30.12.2014    9324
30.12.2013    9138
31.12.2014    8347
              ...
14.05.2015    1174
28.04.2015    1154
06.10.2015    1152
13.05.2015    1128
12.05.2015    1123
Length: 1034, dtype: int64